
; This text is the text resource of WimTool - V2.0.2026.0103 version, and it must be in Unicode (UTF-16LE) encoding format;
; It supports whole-line comments and end-of-line comments starting with ";" or "//", but does not support paragraph comments;
; The content within "[ ]" is the section name of the INI configuration file. Do not modify the characters within, and the order of the sections cannot be changed. 

1. The file directory path defined in the configuration file must start with a '\' or '*'.
2. A path starting with '\' is an absolute path relative to the root. The definition of the root can be found in points 10 and 11.
3. A path starting with '*' is a relative path, relative to any directory of the root, and may match multiple times.
4. '?' matches any single character, but does not match '\' or '.' or the entire string.
5. '*' matches a string, but does not match '\' or '.', that is, it matches any file directory without an extension.
6. "*.*" matches any file directory with any extension (but does not match those without an extension).
7. Wildcards '*' and '?' can be used in multi-level directories, such as "\Win????\SYSTEM*\*.EXE".
8. If it is a definite file directory, try not to use wildcards, such as "\PageFile.SYS".
9. File directory names are case-insensitive, that is, they do not distinguish between upper and lower case, for example, "C:\" is the same as "c:\".
10. The root is similar to the definition in DOS. For example, if capturing the "D:\Tool" directory, the root is "D:\Tool".
11. If a WIM image is extracted to "D:\MyTools", the root is "D:\MyTools".

[ExclusionList]	//Set the excluded file directories, which will not be captured or decompressed.
		//The file directory of this section can be increased or decreased as needed.

\$NTFS.LOG
\$Recycle.Bin
\$Windows.~bt
\$Windows.~ls
\Hiberfil.SYS				//Hibernate File
\PageFile.SYS				//Virtual Memory
\Recycled				//Recycle Bin directory

\Recycler				//Recycling Station directory
*\Temp					//Temporary File directory
*\Tmp					//Temporary File directory
\Windows\CSC				//Offline Files Cache Directory
\System Volume Information		//System Volume Information directory

//The following 4 lines are commented out as examples; remove the comments to make them functional
;\Windows\Temp\*			//This can represent all files in a certain directory
;\Windows\System32\Config\*.LOG*	//Residual garbage in registry directory
;\Windows\System32\Config\*.BLF		//Residual garbage in the registry directory(this method can represent a certain type of file in a certain directory)
;\Windows\System32\Config\*.*		//can also be represented in this way, as it does not match those written without an extension

[ExclusionException]		//Set an exception list, and the file directories in the table will be unconditionally captured or decompressed.
//The setting of this rule is to exclude a certain type of file while retaining several of them.

[CompressoExclusionList]	//Set compressed files to no longer be compressed to speed up capture.
//The files in this section can be added or removed by oneself
//Exclude the following types of files from the compression sequence, which will not be compressed within the WIM image.
*.7Z
*.BZ2
*.CAB
*.GZ
*.MP3
*.PNF
*.RAR
*.TAR
*.WIM
*.ZIP

[Alignment List]		//Set the file to align at the 64K boundary. Any file aligned at the 64K boundary will not be compressed,
				//Usually, this rule has little meaning, and I have never set or applied this rule.

[System_Flag]	//A list of system flags that can be modified, supplemented, or deleted during language localization.
Select Or Fill In
Education Edition
Embedded Edition
Enterprise Edition
Enterprise LTSB
Enterprise LTSC
Home Basic Edition
Home Edition
IoT Core Edition
IoT Enterprise
IoT Enterprise LTSC
Mobile Edition
Mobile Enterprise
Premium Edition
Professional Edition
Standard Edition
Starter Edition
Ultimate Edition

[Compress_Type]			//List of compressed types. When localizing the language, this section can only be translated and cannot be modified or deleted.
None(NONE)
Default(XPRESS)
Maximum(LZX)
Extreme(LZMS)

[Help_Text1]
                    This page has four functions
1. Refresh List
Add images mounted by other tools to the table or remove images uninstalled by other tools, Operation has no options.
2. Mount image
The required options include image file name, target directory, and image number. Rewritable mounting is optional.
3. Uninstall image
The required option is the target directory for mounting the image, and [execute uninstall command] is optional.Uninstall the writable method by clicking the [Uninstall Image] button or double clicking the mounted volume number in the list When mounting an image, WimTool will prompt. Double clicking on the header will uninstall all mappings without modification Like, double clicking on a file in the list also uninstalls the image without modification. WimTool cannot be mounted Or uninstall the subcontracted files.
4. Unfold the image
The required option is the same as 1, there are no options available. This tool can unpack the split package file
The subcontracted files must be located in the same directory and have a name that matches the WIM image generated by ImageX splitting The naming convention of the subcontracted files matches.
[Help_Text2]
                                       This page has three functions.
1. Define image configuration file
In this configuration file, when creating an image, you can define which files or directories are not captured in the WIM image and which files are in the WIM image
Internally not compressed again, those files are aligned at 64K boundaries; When unpacking the image, you can also define which files are extracted and which files are not Being decompressed. The definition of this configuration file is compatible with ImageX, and you can use your ImageX configuration file.
2. Create a new image file
The required options include the source directory to create the Wim image and the file name to save the image. The optional options include compression type, volume name, volume description, and boot tag.
3. Add a new volume to the image
The required options are the same as Part 1, but the optional ones are the volume name, volume description, and startup tag. When the saved image file exists, WimTool will
Select the compression type that matches the original image and automatically select the append method. Appending a new image volume to a split pack file is not supported. If you are concerned about the image
I am not very familiar with the configuration file, please do not modify it, just use the default settings.

[Help_Text3]
      This page has three functional sections 
1. Export and merge
To export the image volume existing in Wim file to a new Wim image or import it into another Wim file, you must select the active file name, the image number in the source file and the target file name. When a volume is exported from a WIM image as a brand new WIM image, the compression type of the target image is optional. With the export function, a group of split packages can be merged into a Wim image file; The export function can be used to optimize WIM image files.
2. Split the image

Required options include split Wim file, saved file after split and subcontract size, and there are no options. When exporting a shadow to a brand-new image, changing its compression type may slow down the operation; When importing a volume into an image, the compression type is determined by the target image; When splitting WIM files, it is recommended not to use numbers as basic names in subcontracting files. The split WIM file does not support being split again, nor does it support importing image volumes into split package files.
3. Optimize the conversion

It can also realize the conversion of compression type and file optimization, and the required option is WIM source file; If the target file name exists, the source file is optimized or converted to the target file, otherwise, the source file is optimized or converted.
4. Precautions

Extreme compression (LZMS) is ESD compression. The file extensions of this compression type can be interchanged, and the conversion of compression types can be realized by exporting the merge function, including the interchange between WIM and ESD. The file obtained by compression type conversion with export function is smaller, but the conversion operation takes longer.

[Help_Text4]
          This page has three functions
1. Delete Image Volume
Delete a specified image from a Wim file containing multiple volumes
Volume, required options are Wim image file name and image volume number,
There are no options available. You cannot delete an image volume in a split package.
Deleting image volumes from Wim files only removes metadata and
Related entries do not reduce the size of Wim files.
2. View image information
To view Wim image information, the required option is the file name,
No options available, you can select the corresponding image volume from the list.
3. Modify image information
The required option is the file name, which can be selected from the list
Modify the corresponding image information of the image volume.

[Help_Text5]
                             Instructions for Shell Execution Extension Settings
1. Target mounting directory: It specifies the directory to be mounted after double clicking the WIM image. If this directory is not set, WimTool will be automatically mounted
Under the "Automatically Mount Basic Directory" setting; Use WimMount When driving SYS, these directories must be empty directories in NTFS partitions.
2. Mount completion execution: refers to the execution of commands within WIM after mounting, hereinafter referred to as the "mount command".
3. Execute before uninstallation: refers to the command to be executed before uninstallation, hereinafter referred to as the "uninstallation command". The 'mount command' and 'unload command' are currently available
Only supports Windows systems EXE file (with parameters),
4. End automatic uninstallation: refers to the automatic uninstallation of WIM after the execution of the "mount command", and the execution of the "uninstall command" and "delete uninstall directory" Waiting for the operation.
5. The following environment variables are supported in the shell execution extension:

   %MountDir%: represents the mount directory of the Wim image

   %AppPath%:  Indicates the directory where WimTool is located
   %WimFile%:  represents the mounted Wim image file

[Help_Text6]
         This page has four functions
1. Set image extension icon
Required image file name, icon resource file name
Icon size is optional. Using WimTool
Register for the icon extension function to see the display effect.
Do not write 64 * 64 or larger icons on machines with poor performance.
2. Delete image extension icon
Required image file name, no options available.
3. Rebuilding the system icon cache
When the WIM extension icon fails to display or the system icon appears
When an error occurs, rebuilding the icon cache can make the icon display correctly
Usually, rebuilding the icon cache may cause the resource manager to view it
The icons in the picture are rearranged.
4. Extract icons from files
The required options are EXE, DLL, CPL, etc., which contain icons
Resource file, select an icon from the resource and save it
Save as icon ICO file.

[Help_Text7]
                           This page has six functions
1. Set file association
Used to set up the ability to mount WIM images through WimTool when double clicking WIM files, and execute the settings within the WIM image
Mount processing command. If the WIM image does not have a mount processing command set, open the mount directory.
2. Cancel file association
Used to cancel the file association setting between WIM image files and WimTool. When WIM file associations appear in the system
When there is an error or exception, you can first click [Cancel File Association], and then click [Set File Association] to fix it.
3. Registration extension function
There are three parts to the extension function: one is the right-click extension menu, which allows you to access WIM files and folders through the right-click menu
Use WimTool for quick processing, such as mounting WIM files, compressing folders into WIM images, and mounting directories
Uninstalling WIM images, etc; The second is the extension of shell icons, where each WIM file can set its own unique icon,
Just like different EXE files have different icons; The third is the extension of shell execution, which is the file association function. These three
Some functions can be registered separately without affecting each other.
4. Uninstall extension function
Including uninstalling [right-click extension menu], [shell icon extension], and [shell execution extension], these three functions can
Uninstalling separately without affecting each other.
5. Default parameter settings
Restore the default settings of WimTool's initial parameters, automatic mounting base path, and WIM temporary working directory.
6. Save parameter settings
Save the settings for WimTool parameters, automatic mounting of basic paths, and WIM temporary working directory. These settings will
Associate the parameter settings on the first page.
When a WIM image is not properly mounted, it will be automatically mounted to a subdirectories under the 'auto mount base path';
It is recommended to set the temporary working directory of WIM to a location with sufficient free space on the hard drive. Setting this directory will not affect the system The temporary directory.

[Help_Text8]
           Extended function description
1. The extended function is not a function of WIMGAPI.DLL, and the three functions can be registered separately without affecting each other.
2. After registering the extension function of the shell icon, the resource manager of some computers may be unstable, so you can uninstall it.

[String_List]	//Character resource list. When localizing the language, this section can only be translated and cannot be modified or deleted.
0=Mount Apply
1=New Add
2=Export Split
3=Delete View
4=Browse Edit
5=Shell Exec
6=Shell Icon
7=Settings
8=Help
9=WimTool - Edit Configuration File
10=Execute unfolding image task...
11=Open Image File...
12=Registration callback message...
13=Set temporary directory...
14=Load Image Volume...
15=Start unfolding image...
16=Close Image Volume...
17=Unload callback message...
18=Close Image File...
19=Expand Image File...
20=User terminated operation!
21=Done
22=Fail
23=Yes
24=No
25=Mount image file...
26=Unable to find the image path mounted in the list,
27=It is possible that the mounting path has been uninstalled by other tools.
28=Choose the method of uninstalling WIM images
29=The WIM image you uninstalled is mounted in a writable manner,
Will the modification results be updated to the original WIM file during uninstallation?
31=To update selection [Yes], do not update selection [No], abandon operation selection [Cancel].
32=Uninstall image file
33=Lock
34=Wim File
35=Mount Path
36=Index
37=Write
38=Select the destination folder to Mount or Apply
39=The directory where the WIM image was unpacked already contains files,
40=Unopened files from WIM images will overwrite the original files,
41=Do you want to continue unpacking the WIM image and overwriting the original files?
42=Continue to unlock the selection [Yes], do not unlock the selection [No].
43=Choose whether to continue unraveling WIM image
44=The file already exists in the target folder!
45=WIM images cannot be mounted to directories with existing files.
46=prompt
47=Refresh Mount List
48=Number of mounted volumes:% u
49=Uninstall image file:% s ...
50=No image available for uninstallation, image locked.
51=UsedTime:
52=RemainTime:
53=NumOfFiles:
54=ApplyImage
55=ConfigFile
56=UnMount
57=MountImage
58=UpdateList
59=Select WIM File To Mount Or Apply
60=Select the destination folder to Mount or Apply
61=Mounted Image Information
62=Browse
63=Option[2]
64=Option[1]
65=Prompt Message
66=DeletePathAfterUnMount
67=DbClickPath To Open
68=DbClickFile UnMount
69=DbClick Header UnMount All
70=Clear File SECTY
71=ClearPrompting
72=MountRW Method
73=Open Directory
74=NotUse CFG File
75=Index:
76=Termination of Execution
77=May not be Mounted or UnMounted
78=the target image is a split package file, and the image cannot be added to the split package!
79=Execute additional image task...
80=Execute the task of creating a new image...
81=Add Image Volume...
82=Create Image File...
83=Add startup flag...
84=Add Image File...
85=New Image File...
86=Save WIM file
87=Run Mount & UnMount PROC
88=Select the source directory to be created as a WIM image
89=Choose the file name to save the WIM image
90=ImageName:
91=ImageDesc:
92=Disp Name:
93=Disp Desc:
94=Add Image
95=New Image
96=Compress:
97=Sys Flag:
98=Add Boot Flag To Image
99=Clear Hint Before Task
100=Do Not Use Config File
101=Execute segmentation task...
102=Open Source File...
103=The subcontracting files are as follows:
104=Split Image File...
105=Execute export task...
106=Open Target File...
107=Export Image Volume...
108=Export Image File...
109=Close target file...
110=Close Source File...
111=Error opening subcontract file!
112=Image Export Task...
113=it is already a split package file, cannot be split again!
114=Export
115=Select WIM file or sub package file to export
116=Select WIM destination file or merged file
117=Split
118=Select the WIM source file name to be split
119=Select the split WIM target file name
120=Identify a target WIM file
121=Package size setting error!
122=Choose whether to terminate the current operation?
123=WimTool is performing an export image operation. If the current operation is terminated,
124=The obtained file will be incomplete or damaged,
125=It is recommended that you do not terminate the current operation!
126=To terminate the current operation, select [Yes], and to continue the current operation, select [No].
127=unknown
128=Number Of Folder
129=ImageName:
130=Task selection and goal setting
131=SplitSize(M):
132=Please select a file with extension '.wim'
133=Windows Image Format
134=In prediction...
135=Default
136=closed
137=Application
138=Save
139=Load
140=prompt
141=If you are not familiar with this configuration file, please do not modify it and use the default settings.
142=If you have modified it and want to use the default settings, please click the [Default] button.
143=[current]
144=Save configuration file
145=The target file already exists,
146=Does it overwrite existing files?
147=overwrite the original file selection [Yes], otherwise select [No].
148=Choose whether to overwrite existing files
149=Select a resource file containing icons or images
150=Open file
151=Image Name
152=Architecture
153=OS Version
154=Language
155=Expand Size
156=Image Information
157=Modify Image Information
158=Delete Image Volume
159=WIM File
160=Read image information
161=belongs to the split package file [% u/% u], information cannot be modified!
162=Please select a volume number from the list.
163=Delete Image Volume
164=Image information has been updated.
165=Modify Image Information...
166=Basic Information
167=file path:
168=total number of screenings:
169=Subcontract file:
170=Start screening:
171=[No setting]
172=Image size:
173=Number of directories:
174=modification time:
175=WimTool is performing an unfolding image operation. If the current operation is terminated,
176=I suggest you not terminate the current operation!
177=WimTool is performing a capture image operation. If the current operation is terminated,
178=Select target mounting directory
179=Set WimTool Shell Extension Function...
180=Clear WimTool Shell Extension Function...
181=WimTool Shell Extension Function Settings
182=WritableMount
183=EndAutoUnMount
184=UnMuntSaveChanges
185=UnMountDeleteDIR
186=Mount DIR:
187=Carry Out:
188=UnMountDoing:
189=Option
190=Name:
191=Desc:
192=Clear Setting
193=Use Settings
194=split package file, icon data cannot be written!
195=Execute write extension icon task
196=Execute the task of deleting extended icons
197=Set extension icon
198=Delete icon data
199=failed, unable to write icon data.
200=Failed, unable to read icon data.
201=The requested task has been successfully completed.
202=The requested task cannot be completed.
203=IconResource
204=rebuilding icon cache completed, it is recommended to restart or log out.
205=Save IconFile
206=Icon file (*.ICO)
207=Choose whether to overwrite the original icon file
208=The target icon file already exists,
209=Do you want to overwrite the original icon file?
210=The user canceled the operation.
211=Icon List
212=icon size
213=Refresh Icons
214=Del Ext Icon
215=Write ExtIcon
216=IconResource
217=WIM image and icon resources
218=Icon size and display effect
219=WIM extension icon
220=no icon
221=Do you want to continue with the operation you have chosen?
222=All file directories in this directory will be deleted!
223=Continue with selection [Yes], cancel selection [No].
224=Clean up WIM auto mount base directory...
225=Clean up WIM temporary working directory...
226=WimTool - Registration Extension Function
227=WimTool - Uninstall Extension Function
228=Load default parameter settings...
229=Apply and save current settings...
230=Select WIM to automatically mount the base directory
231=Select WIM temporary working directory
232=Except for the directory where the WIM image is mounted,
233=Set File ASSOC
234=Cancel FileASSOC
235=WimTool directory settings
236=Cleaning
237=Auto Mount Path:
238=WIM Temp Path:
239=Save Settings
240=Default Setting
241=Unins Extension
242=Regi Extension
243=Parameter Settings
244=Clear Information
245=Completed Open DIR
246=UnCompress image...
247=Capturing image...
248=Cancel
249=To update selection [Yes], do not update selection [No].
250=Registration Options
251=uninstallation option
252=Explorer Shell Icon Extension
253=Explorer Shell Menu Extension
254=Resource Manager Shell Execution Extension
255=Failed to establish basic mount directory,
256=Please set the base mount directory to a writable partition.
257=Failed to establish temporary working directory,
258=Please set the temporary working directory to a writable partition.
259=Registration Shell Icon Extension Extension...
260=Uninstall Shell Icon Extension Extension...
261=Registration Shell Menu Extension Extension...
262=Uninstall Shell Menu Extension Extension...
263=Error loading extension function DLL!
264=Register Shell Execution Extension Extension...
265=Uninstall the shell to execute the extension...
266=It is recommended to restart or log out.
267=WimTool - WIM Image Processing Tool
268=Copy (Ctrl+C)
269=Select All (Ctrl+A)
270=Copyright Lxl1638,All Rights Reserved.
271=Select Target Folder To unlock
272=Processing with WimTool...
273=Add to WIM Image...
274=Read only uninstallation with WimTool
275=Can be written and UnMount Using WimTool(&W)
276=Add to WIM Image...
277=Added to
278=Extract to
279=Extract to specified directory...
280=Read only mounting with WimTool
281=Write Mount with WimTool(&W)
282=Use WimTool to UnMount All(&T)
283=Thread terminated abnormally, WimTool must be closed before deleting residual file.
284=Safe Stop
285=ForceFinish
286=Return
287=It is recommended to choose [Safe Stop] and wait for the thread to end normally.
288=[ForceFinish] will end immediately, but may cause the program to crash.
289=To continue with the current operation, select [Return].
290=WimTool is performing a split image operation. If the current operation is terminated,
291=WimTool - View XML Information
292=Image Details
293=Give me a name
294=Exporting image ..
295=DLL BuiltIn Code,
296=View WIM Information
297=System Architecture:
298=System version:
299=Expand size:
300=default language:
301=WimTool.EXE and WimShExt.DLL in the same directory do not exist, or 64-bit and 32-bit do not match.
302=The image is too large to be converted into an icon!
303=Not detected.
304=WimTool does not match the 64 bit or 32-bit system!
305=The target WIM file already exists, and the newly created file will overwrite the original file,
306=To confirm the selection of the newly created file [OK],discard the operation and select [Cancel].
307=Top up
308=Extraction...
309=Additional...
310=Delete...
311=Open...
312=Attribute...
313=Serial Number
314=file directory
315=Type Name
316=file size
317=creation time
318=modification time
319=Display image extension icon
320=Open the file when double clicked
321=Volume Image
322=Please select the destination directory to extract the file to.
323=Extract file
324=Please select a directory to join.
325=Add new volume
326=Please select a file directory to append.
327=Add file directory
328=Delete Volume Image
329=Are you sure you want to delete this volume image in WIM?
330=Confirm deletion selection [Yes], abandon deletion selection [No].
331=Delete file directory
Are you sure you want to delete this file directory in WIM?
333=Adding and creating a new volume,
334=This process does not display progress, please wait...
335=Adding file directory
336=Deleting file directory
337=Deleting volume image
338=WimTool is performing a file extraction operation. If the current operation is terminated,
339=Creation time:
340=Recompress During Optimization
341=Extraction completed, open directory
342=Only one file directory can be appended here, not the entire partition.
343=Only directories can be dragged here, files cannot be dragged.
344=WimTool is not executed as an administrator and its functionality may be restricted.
345=New Folder
346=Superior directory
347=Folder
348=File
349=ReName...
350=Optimize...
351=Optimize image
352=The same image volume already exists in the target file.
353=Conversion Task ..
354=Optimization Tasks ..
355=Error Code:
356=Split Package File, Not Supported!
357=Image description
358=Select a source WIM file to be optimized or converted
359=Select an optimized or converted target WIM image file
360=WimTool is performing an optimization conversion. If the current operation is terminated,
361=Conversion
362=Already exists and has been imported
363=Service Anomaly,
364=Cannot be Mounted or UnMounted
365=SYS and DLL versions do not match,
366=List Excluded Items
367=WIMLIB and Hot Backup Support
368=Has Been Excluded:
369=Enable Hot Backup Environment...
370=The Source Do Not Support Hot Backup.
371=Search
372=New target file ...
373=Optimize the conversion image ...
374=Optimizing image ...
375=Set image information ...
376=Requested operation ...
377=Number of files
